# StairsWinderpatternNumberOfStraightStepsAtBegin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsWinderpatternNumberOfStraightStepsAtBegin Property
ParameterTypeId Class See Also
---
"Parallel Treads at Start": Number of straight steps at the begin of winder
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderpatternNumberOfStraightStepsAtBegin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsWinderpatternNumberOfStraightStepsAtBegin {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace